Tekla Open API Reference for Tekla Structures 2025
Dialogs.GetPluginWindowBaseByPluginFormName Method
 Retrieves an instance of the form.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PluginWindowBase GetPluginWindowBaseByPluginFormName(
	string pluginFormName
)
Public Shared Function GetPluginWindowBaseByPluginFormName (
	pluginFormName As String
) As PluginWindowBase
Parameters
pluginFormName
Type: System.String
The complete name of the plug-in form (including the plug-in name).
Return Value
Type: PluginWindowBase
The existing PluginWindowBase or null if it did not exist.
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace